{
  "class": [
    {
      "name": "Barbarian",
      "description": "Primal warriors defined by an unquenchable and unthinking rage. They use their battle fury to improve reflexes, gain resilience, and perform extraordinary feats of strength.",
      "hd": "12",
      "proficiencies": [
                     "You are proficient with the following items, in addition to any proficiencies provided by your race or background.",
                     "<strong>Armor:</strong> light armor, medium armor, shields",
                     "<strong>Weapons:</strong> simple weapons, martial weapons",
                     "<strong>Tools:</strong> none",
                     "<strong>Saving Throws:</strong> STR, CON",
                     "<strong>Skills:</strong> Choose two from Animal Handling, Athletics, Intimidation, Nature, Perception, and Survival"
                      ],
      "equipment": [
                     "You start with the following items, plus anything provided by your background.",
                     "<ul><li>(a) a greataxe or (b) any martial melee weapon</li><li>(a) two handaxes or (b) any simple weapon</li><li>An explorer's pack, and four javelins</li></ul>",
                     "Alternatively, you may start with 2d4 × 10 gp to buy your own equipment."
                   ],
      "leveltable": [
        {
          "rages": "2",
          "ragedamage": "+2",
          "level": "1"
        },
        {
          "rages": "2",
          "ragedamage": "+2",
          "level": "2"
        },
        {
          "rages": "3",
          "ragedamage": "+2",
          "level": "3"
        },
        {
          "rages": "3",
          "ragedamage": "+2",
          "level": "4"
        },
        {
          "rages": "3",
          "ragedamage": "+2",
          "level": "5"
        },
        {
          "rages": "4",
          "ragedamage": "+2",
          "level": "6"
        },
        {
          "rages": "4",
          "ragedamage": "+2",
          "level": "7"
        },
        {
          "rages": "4",
          "ragedamage": "+2",
          "level": "8"
        },
        {
          "rages": "4",
          "ragedamage": "+3",
          "level": "9"
        },
        {
          "rages": "4",
          "ragedamage": "+3",
          "level": "10"
        },
        {
          "rages": "4",
          "ragedamage": "+3",
          "level": "11"
        },
        {
          "rages": "5",
          "ragedamage": "+3",
          "level": "12"
        },
        {
          "rages": "5",
          "ragedamage": "+3",
          "level": "13"
        },
        {
          "rages": "5",
          "ragedamage": "+3",
          "level": "14"
        },
        {
          "rages": "5",
          "ragedamage": "+3",
          "level": "15"
        },
        {
          "rages": "5",
          "ragedamage": "+4",
          "level": "16"
        },
        {
          "rages": "6",
          "ragedamage": "+4",
          "level": "17"
        },
        {
          "rages": "6",
          "ragedamage": "+4",
          "level": "18"
        },
        {
          "rages": "6",
          "ragedamage": "+4",
          "level": "19"
        },
        {
          "rages": "Unlimited",
          "ragedamage": "+4",
          "level": "20"
        }
      ],
      "features" : [
        {
          "level": 1,
          "subclass": "base",
          "name": "rage",
          "title": "Rage",
          "text": "In battle, you fight with primal ferocity. On your turn, you can enter a rage as a bonus action. While raging, you gain the following benefits if you aren't wearing heavy armor:<ul><li>You have advantage on Strength checks and Strength saving throws.</li><li>When you make a melee weapon attack using Strength, you gain a +2 bonus to the damage roll. This bonus increases as you level.</li><li>You have resistance to bludgeoning, piercing, and slashing damage.</li></ul><p>If you are able to cast spells, you can't cast them or concentrate on them while raging.</p><p>Your rage lasts for 1 minute. It ends early if you are knocked unconscious or if your turn ends and you haven't attacked a hostile creature since your last turn or taken damage since then. You can also end your rage on your turn as a bonus action.</p><p>Once you have raged the maximum number of times for your barbarian level, you must finish a long rest before you can rage again.</p>"
        },
        {
          "level": 1,
          "subclass": "base",
          "name": "unarmoreddefense",
          "title": "Unarmored Defense",
          "text": "While you are not wearing any armor, your Armor Class equals 10 + your Dexterity modifier + your Constitution modifier. You can use a shield and still gain this benefit."
        },
        {
          "level": 2,
          "subclass": "base",
          "name": "dangersense",
          "title": "Danger Sense",
          "text": "At 2nd level, you gain an uncanny sense of when things nearby aren't as they should be, giving you an edge when you dodge away from danger. You have advantage on Dexterity saving throws against effects that you can see, such as traps and spells. To gain this benefit, you can't be blinded, deafened, or incapacitated."
        },
        {
          "level": 2,
          "subclass": "base",
          "name": "recklessattack",
          "title": "Reckless Attack",
          "text": "Starting at 2nd level, you can throw aside all concern for defense to attack with fierce desperation. When you make your first attack on your turn, you can decide to attack recklessly. Doing so gives you advantage on melee weapon attack rolls using Strength during this turn, but attack rolls against you have advantage until your next turn."
        },
        {
          "level": 3,
          "subclass": "base",
          "name": "primalpath",
          "title": "Primal Path",
          "text": "At 3rd level, you choose a path that shapes the nature of your rage. Choose the Path of the Berserker or the Path of the Totem Warrior, both detailed at the end of the class description. Your choice grants you features at 3rd level and again at 6th, 10th, and 14th levels."
        },
        {
          "level": 3,
          "subclass": "berserker",
          "name": "berserker-pp",
          "title": "Primal Path: Path of the Berserker",
          "text": "For some barbarians, rage is a means to an end—that end being violence. The Path of the Berserker is a path of untrammeled fury, slick with blood. As you enter the berserker's rage, you thrill in the chaos of battle, heedless of your own health or well-being."
        },
        {
          "level": 3,
          "subclass": "berserker",
          "name": "berserker-frenzy",
          "title": "Path of the Berserker: Frenzy",
          "text": "Starting when you choose this path at 3rd level, you can go into a frenzy when you rage. If you do so, for the duration of your rage you can make a single melee weapon attack as a bonus action on each of your turns after this one. When your rage ends, you suffer one level of exhaustion."
        },
        {
          "level": 3,
          "subclass": "totem",
          "name": "totem-pp",
          "title": "Primal Path: Path of the Totem Warrior",
          "text": "<div>The Path of the Totem Warrior is a spiritual journey, as the barbarian accepts a spirit animal as guide, protector, and inspiration. In battle, your totem spirit fills you with supernatural might, adding magical fuel to your barbarian rage.</div><div>Most barbarian tribes consider a totem animal to be kin to a particular clan. In such cases, it is unusual for an individual to have more than one totem animal spirit, though exceptions exist.</div>"
        },
        {
          "level": 3,
          "subclass": "totem",
          "name": "totem-pp",
          "title": "Path of the Totem Warrior: Spirit Seeker",
          "text": "Yours is a path that seeks attunement with the natural world, giving you a kinship with beasts. At 3rd level when you adopt this path, you gain the ability to cast the beast sense and speak with animals spells, but only as rituals, as described in chapter 10."
        },
        {
          "level": 3,
          "subclass": "totem",
          "name": "totem-pp",
          "title": "Path of the Totem Warrior: Totem Spirit",
          "text": "<div>At 3rd level, when you adopt this path, you choose a totem spirit and gain its feature. You must make or acquire a physical totem object—an amulet or similar adornment—that incorporates fur or feathers, claws, teeth, or bones of the totem animal. At your option, you also gain minor physical attributes that are reminiscent of your totem spirit. For example, if you have a bear totem spirit, you might be unusually hairy and thick-skinned, or if your totem is the eagle, your eyes turn bright yellow.</div><div><strong>Bear:</strong> While raging, you have resistance to all damage except psychic damage.</div><div><strong>Eagle:</strong> While you're raging and aren't wearing heavy armor, other creatures have disadvantage on opportunity attack rolls against you, and you can use the Dash action as a bonus action on your turn.</div><div><strong>Elk:</strong> While you're raging and aren't wearing heaving armor, your walking speed increases by 15 feet.</div><div><strong>Tiger:</strong> While raging, you can add 10 feet to your long jump distance and 3 feet to your high jump distance.</div><div><strong>Wolf:</strong> While you're raging, your friends have advantage on melee attack rolls against any creature within 5 feet of you that is hostile to you.</div>"
        },
        {
          "level": 4,
          "subclass": "base",
          "name": "asi",
          "title": "Ability Score Increase",
          "text": "When you reach 4th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature. You may instead take a feat."
        },
        {
          "level": 5,
          "subclass": "base",
          "name": "extraattack",
          "title": "Extra Attack",
          "text": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn."
        },
        {
          "level": 5,
          "subclass": "base",
          "name": "fastmovement",
          "title": "Fast Movement",
          "text": "Starting at 5th level, your speed increases by 10 feet while you aren't wearing heavy armor."
        },
        {
          "level": 6,
          "subclass": "base",
          "name": "pp-feature-1",
          "title": "2nd Path Feature",
          "text": "At 6th level, you gain a feature from your Primal Path."
        },
        {
          "level": 6,
          "subclass": "subclass",
          "name": "berserker-mindless",
          "title": "Path of the Berserker: Mindless Rage",
          "text": "Beginning at 6th level, you can't be charmed or frightened while raging. If you are charmed or frightened when you enter your rage, the effect is suspended for the duration of the rage."
        },
        {
          "level": 6,
          "subclass": "totem",
          "name": "totem-aspect",
          "title": "Path of the Totem Warrior: Aspect of the Beast",
          "text": "At 6th level, you gain a magical benefit based on the totem animal of your choice. You can choose the same animal you selected at 3rd level or a different one. \n<strong>Bear:</strong> ou can see up to 1 mile away with no difficulty, able to discern even fine details as though looking at something no more than 100 feet away from you. Additionally, dim light doesn't impose disadvantage on your Wisdom (Perception) checks. \n<strong>Eagle:</strong> While you're raging and aren't wearing heavy armor, other creatures have disadvantage on opportunity attack rolls against you, and you can use the Dash action as a bonus action on your turn.\n<strong>Elk:</strong> Whether mounted or on foot, your travel pace is doubled, as is the travel pace of up to ten companions while they're within 60 feet of you and you're not incapacitated.\n<strong>Tiger:</strong> You gain proficiency in two skills from the following list: Athletics, Acrobatics, Stealth, and Survival.\n<strong>Wolf:</strong>  You can track other creatures while traveling at a fast pace, and you can move stealthily while traveling at a normal pace."
        },
        {
          "level": 7,
          "subclass": "base",
          "name": "feralinstinct",
          "title": "Feral Instinct",
          "text": "You have advantage on initiative rolls. Additionally, if you are surprised at the beginning of combat and aren't incapacitated, you can act normally on your first turn, but only if you enter your rage before doing anything else on that turn."
        },
        {
          "level": 8,
          "subclass": "base",
          "name": "asi",
          "title": "Ability Score Increase",
          "text": "When you reach 4th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature. You may instead take a feat."
        },
        {
          "level": 0,
          "subclass": "base",
          "name": "NAME",
          "title": "TITLE",
          "text": "TEXT"
        }
      ]
    }
  ]               
}