{
  "recap": [
    {
        "title": "S1 - Into Mornrise",
        "number": "1",
        "date": "2018 Apr, 18",
        "text": [
          "<h4>A Chance Meeting</h4>",
          "A rattag group of 'guards' continue westward into Pfennig's outland Valley along a winding stone path following the river from Iverness to Mornrise. The stone road curves around a bend and the group happens uppon an unusual sight. A Tiefling, Aasimar, and human resting near one of Arowen's Wayshrines. Introductions are made and the group agrees to travel together towards Mornrise. Groups, after all, are much safer.",
          "<h4>Explosive Summons</h4>",
          "<blockquote class='recapquote'><em>The valley is suddenly filled with a sound that rumbles the earth and blows back grass. A chorus of otherworldly screams are heard off in the distance. Moments later, three large demonic figures emerge from the other side of a hill just ahead, taking to the air with broad, feathery wings. Black smokes streams up into the sky from where the figures emerged.</em></blockquote>",
          "The group investigates a small cave around 400 ft. off the road. Think black smoke stream from the cave mouth and the surfaces inside are badly scorched from the explosion. Charred corpses of several humanoids lie in the cave and the center of the cave is dominated by a ritual circle drawn in blood.",
          "Idri and Arkri investigate and find that all the cultists in the cave were dead before the explosion. Each died of a dagger wound in the chest. Ørigen finds a pair of horse tracks outside the cave mouth leading back to the West.",
          "When the group leaves the caves they are confronted by two Hell Dogs and their Hellriders. The demons are especially vicious and the fight leaves Ronin, Idri, and Arkri unconsious but the others prevail and drag their companions back to the merchant cart so that they can continue on.",
          "<h4>Bridge Over Troubled Spiders</h4>",
          "Sometime later after everyone regains consiousness the group comes upon a large stone bridge that appears to be infested with Spiders. They decide to forgo speed in favor of not risking a fight and they spend a few hours pulling the cart aside and pushing it up onto the other side of the ravine.",
          "While crossing underneath the bridge Tyche spots what appears to be a precious gem hanging underneath the bridge amongst Giant Spiders. A lucky shot with one of her spells and an even luckier grab using her quarterstaff gets the the treasure before the spiders notice what's happening. Only Idri gets caught in spiderweb trying to escape with Arkri's help he still manages to get to safety before being bitten.",
          "<h4>Can't Stop Here, This is Shadow Country</h4>",
          "<blockquote class='recapquote'><em>\"We've dawdled too long, if you want to live get in this cart and do your best to keep them off of us.\"</em></blockquote>",
          "The group is still a mile outside of town when the sun sets. Shadows lengthen then take on a life of their own when they aren't stopped by running water or Arowen's wards. Everyone climbs into the merchant's cart and they begin a hcetic ride to get inside Mornrise's moat. The group hold off the shadows and get to safety. The merchant pays the group for sucessfully protecting his return home, even throwing in a share for Ronin and Idri who weren't exactly hired.",
          "<h4>Mornrise</h4>",
          "The group splits up to take care of personal business in town before getting rooms at <a>Silverwood Inn</a> for the night. Idri vists the <a>Mornrise Chapel</a> and prays to the <a>Memorial of Childe Roland</a>. Tyche searchs for a tarot deck at the <a>Golden Swan</a> general store, and buys a magical sword from the proprietor <a>Walter</a> after impressig him with magical knowledge. Arkri meets up with her mysterious contact <a>Aleera</a> and receives her commission to forge documents of passage into Arden for the sisters who own the <a>Fleeting Fox Caravan</a>.",
          "<h4>The Mayor's House</h4>",
          "<blockquote class='recapquote'>The house seems ordinary enough until you come close and notice the mirrored glass in the door has been shattered. Protective symbols engraved on the door frame have been scratched out with a blade, and the door is slightly ajar. The square windows reveal nothing. The house is pitch black.</blockquote>",
          "The next morning Idri asks the group to return with her to Arowen's Chapel and inquire about a job in town. When they arrive <a>Priestess Fiora</a> briefly says the town has two issues: 1) the mayor disappeared and as of a few days ago people in town have begun to suspect his old house is haunted and 2) the <a>hawthorn tree</a> in the old alchemical tower has begun to die, without living wood from the tree the village will be at the mercy of vampires. The group decides to investigate the house first.",
          "The mansion is a grisly seen of smashed glass and blood. A younger man's body is found in a downstairs living area and a mysterious trail of blood ends with a puddle in an upstairs music room.",
          "An angry spirit begins to attack the group but Idri soothes it with calming words and a prayer. Sheet music and painting in the music room provide enough clues for Arkri to uncover a lockbox elsewhere in the house. The lockbox contains some emergency funds and an unsealed letter from 'Katrina' to 'Uncle Hanns' where she begs his expertise on silver and the moon to 'unlock a puzzle of utmost importance'. Ørigen acquires a <a>Violin of Banishing Light</a> and the group sets up a proper burial for the body to put the spirit to rest."
        ]
    }
  ],
  "comment": {
        "title": "Sn - Title",
        "number": "n",
        "date": "yyyy Mon, DD",
        "text": [
          "text1",
          "text2"
        ]
    }
}