{
  "recap": [
    {
        "title": "S3 - Night of the Living Dead",
        "number": "3",
        "date": "2018 May, 2",
        "text": [
          "<h3>Ill Tidings</h3>",
          "<blockquote class='recapquote'><em>\"A fog rolled in from the Westfen - it was thicker than usual and carried a chill. Next we heard the screams. The restless dead were upon us. The shambling remains of folk like you and me attacked the living, biting, tearing... Arowen protect us!\"</em></blockquote>",
          "Early in the afternoon word starts to spread that a haggard group of travelers have arrived from a neighboring settlement. <a>Fiora</a>, <a>Captain Ivan</a>, and a growing crowd of onlookers gather at the town gates to find out what happened. The twenty-five folken explain that they rode here overnight from Vodrom (a small farming settlement two days to the southeast of Mornrise) fleeing from an army of walking dead that attacked the town. They can't provide much information but they explain that it seems like the undead horde was moving in the direction of Mornrise.",
          "Mornrisers are a stoic folk, but a rampaging horde of undead is beyond what most are prepared to deal with. Ivan and Fiora say the group has already killed more monsters than many people have ever seen and ask for their advice. The group advises fortifying the town and preparing for a seige. Gene and Ronin go through town imploring (and sometimes intimidating) the folken into taking up arms. Idri, Fiora, and the town blacksmith work together to create a batch of blessed silver that can be used against the undead. Tyche does her best to inspire guardspeople with 'visions' of glory and honor on the battlefield.",
          "Arkri borrows a horse from Captain Ivan and rides out to get some idea of what they might be facing. What she finds isn't an army so much as an abnormally large horde of undead being herded in the same direction by magic. She spends most of the night picking off outliers and doing her best to slow the hordes advance.",
          "<h3>Defending Mornrise</h3>",
          "<h4>Assault on the Gate</h4>",
          "<blockquote class='recapquote'><em>They arrive in the dead of night: the torches and light spells dispel the fog and illuminate the hideous host. Lumbering forward, towering over the other zombies, are two stitched monstrosities. They stride easily through the moat and begin pummeling Mornrise's gate with armor-plated fists. Captain Ivan begins to yell and wave a torch to get attention. \"Fire! Take out those beasts! Hold the gate!\"</em>",
          "The horde arrives first at the Mornrise main gate. The party, guards, and armed townsfolk stand atop the wall and use the placed lights to fire a hail of arrows down upon the monsters in an attempt to stop the stiched goliaths from breaking the gate and allowing more undead in. Just as the gate begins to buckle and crack the party manages to take down the goliaths and pull the injured off the wall and back to safety. A messenger from another part of town runs to the party to deliver the news that on of the far walls has been breached while most were engaged defending the gate. Ivan says his men can hold the gate against zombies and asks the party to make haste and help fighters at the breach.",
          "<h4>The Breached Wall</h4>",
          "As the party nears the wall they see a group of ten fighters and one priest struggling against undead pouring through a ten foot hole in the wall. Another goliath is wreaking havoc with an enormous morningstar.",
          "The party fights back waves of zombies and skeletons and eventually brings down both the goliath and a specter drawn to the scene of carnage. The fighters are able to push back the undead and build a makeshift barricade to close the gap in the wall. From the center of town the party hears the dreadful tool of a ghoulcaller's bell.",
          "<h4>Campanomancer Confrontation</h4>",
          "As they arrive back at the gate they see it has been shattered by a spell and a young woman holding a pair of bells and three leashed zombies is wreaking havoc on Captain Ivan's defenders. She laughs and raves as her bells put guards to sleep and create explosive damaging noise.",
          "The group kill her guard zombies and weaken her until Gene and Origen are able to grapple then tie her up. Once she is unable to continue ringing her bells, the undead breifly falter before becoming weaker and disorganized. As the townspeople celebrate and clear up straggling undead the party prepares to question the young necromancer."
        ]
    },
    {
        "title": "S2 - The Blighted Tree",
        "number": "2",
        "date": "2018 Apr, 25",
        "text": [
          "<h3>Alchemist's Tower</h3>",
          "<blockquote class='recapquote'><em>Hanging above the front door of the short tower is a wooden sign with a potion painted on it. A tall hawthorn tree pokes out of what would be the tower's parapet but instead of fall foliage you see only a perched raven, barren branches, and greying bark. It looks like the tree is dying.</em></blockquote>",
          "Following <a>Preistess Fiora's</a> urging the party sets out to investigate the hawthorn tree growing from the center of the Alchemist's Tower. Fiora explains that it is Mornrise's only source of <a>living wood</a> and without it the folken will have even less protection from the predation of vampires. <a>Seigfried Reinhardt</a>'s shop is left in a state of disuse, and after investigation Ronin discovers that the mantle conceals a lever that opens the fireplace into a stairway spiralling down underneath the hawthorn tree's roots.",
          "Underneath the shop the party finds an alchemical labratory built within a natural cave formed by the roots. Tables are topped by alchemical devices, bottles of strange liquid stand about, and bookshelves overflow with tomes and Siegfried's hastily scribbled notes.",
          "As the party descends into the cave they find that someone is already searching though the possessions there. Terse introductions and harsh words are bandied about until inadventant testing on a magically trapped door causes a group of <a>blights</a> to attack the party.",
          "<h3>Seigfried's Secrets</h3>",
          "After destroying the blights Gene busts down the trapped door and the group follows a half mile tunnel that leads to another cave in the woods southwest outside of Mornrise. There they find the true nature of what Seigfried was hiding under his shop. One of his experiments with necro-alchemy lies finished but unanimated on a stone slab along with a coded letter from a 'cousin' who seems to be helping him with his foul work.",
          "<blockquote class='note'><em><p>A sticher to his faithful cousin, greetings,</p><p>I received yesterday you note and must commend you progress. The designs there enclosed are beyond what most could accomplish in the short time since your apprenticeship began. I am not too proud to say, my dear Siegfried, that even a master craftsman might learn something.</p><p>I write therefore, in full support of your plans to expand your enterprises and to offer a suggestion as to where you might take up lodgings. I have recently learned that the vampires living in the Iverfen have chosen to relocate to their ancestral home in the north. Their manor should serve you admirably as the site of a new laboratory.</p><p>I must also offer my advice on a rather distasteful subject. It has come to my knowledge that you have aligned yourself with a Campanomancer. I must emphasize that working with such villians is simple folly. All such heathens refuse to grant the respect due artists of our abilities. They often delude themselves into believing their own muck-covered endeavours equal our own. More to the point: necromancers are not to be trusted and any alliance forged must be carefully watched and soon severed.</p><p>I wish you the best fortunes in continuing your work and stand ready to assist you in your ongoing studies. <p>Gustav</p></em></blockquote>",
          "As the group decodes the letter and searches for more clues an animated blight much larger than the ones in the previous area attacks the cave. Arkri manages to light it on fire and after destroying it the group recovers a chunk of softly pulsing green amber that seems to be the source of the blights. With the amber in their posession they return to Fiora with news of their deeds.",
          "<h3>Running Errands</h3>",
          "The group returns to Fiora and update her with their findings. After paying them for their help she asks if they could continue their investigations into stopping Seigfried and his alarming brand of necromancy. She says others in town might be able to give them more information, and if all else fails people are always peddling rumors in the Silverwood Inn's bar room. Afterward the group splits up to carry out personal business.",
          "Arkri, Ronin, and Ørigen hold back to ask Fiora about the <a>mysterious object</a> they found in the Mayor's Manor. After investigation Fiora explains that she is aware the mayor's daughter <a>Katrina</a> was looking into some artifact for the Church but doesn't have any more information to give out. She recommends Arkri search her out for more information.",
          "The groups newest 'member' Morior seeks out the town blacksmith to trade for some new armor while Idri collects his cloak from <a>Aleera</a> at the <a>Fleeting Fox Caravan</a>.",
          "<h3>Fortunes in Pfennig</h3>",
          "<blockquote class='recapquote'><em>\"Hello young seer - I see the magic you would seek and the powers your new friends have and I'll offer you something that I don't offer most: prophesy. Bring them here, for you are all connected, and I will tell you of your doom. But beware, once it is known, the future can be a heavy burden.\"</blockquote>",
          "Tyche also goes to the Caravan in search of magical items and is greeted by <a>Marishka</a> who smiles and offers the group true prophecy if they wish to hear it. The group gathers inside the largest of the Fleeting Fox's tents and Mariska shuffles her gilded deck of cards and lays them out before the party:",
          "<img src='https://i.imgur.com/HkGHsKF.jpg' class='img-responsive' alt='Mariskas Fortune'/>"
        ]
    },
    {
        "title": "S1 - Into Mornrise",
        "number": "1",
        "date": "2018 Apr, 18",
        "text": [
          "<h3>A Chance Meeting</h3>",
          "A rattag group of 'guards' continue westward into Pfennig's outland Valley along a winding stone path following the river from Iverness to Mornrise. The stone road curves around a bend and the group happens uppon an unusual sight. A Tiefling, Aasimar, and human resting near one of Arowen's Wayshrines. Introductions are made and the group agrees to travel together towards Mornrise. Groups, after all, are much safer.",
          "<h3>Explosive Summons</h3>",
          "<blockquote class='recapquote'><em>The valley is suddenly filled with a sound that rumbles the earth and blows back grass. A chorus of otherworldly screams are heard off in the distance. Moments later, three large demonic figures emerge from the other side of a hill just ahead, taking to the air with broad, feathery wings. Black smokes streams up into the sky from where the figures emerged.</em></blockquote>",
          "The group investigates a small cave around 400 ft. off the road. Thick black smoke streams from the cave mouth and the surfaces inside are badly scorched from the explosion. Charred corpses of several humanoids lie in the cave and the center of the cave is dominated by a ritual circle drawn in blood.",
          "Idri and Arkri investigate and find that all the cultists in the cave were dead before the explosion. Each died of a dagger wound in the chest. Ørigen finds a pair of horse tracks outside the cave mouth leading back to the West.",
          "When the group leaves the caves they are confronted by two Hell Dogs and their Hellriders. The demons are especially vicious and the fight leaves Ronin, Idri, and Arkri unconsious but the others prevail and drag their companions back to the merchant cart so that they can continue on.",
          "<h3>Bridge Over Troubled Spiders</h3>",
          "Sometime later after everyone regains consiousness the group comes upon a large stone bridge that appears to be infested with spiders. They decide to forgo speed in favor of avoiding a fight and they spend a few hours pulling the cart aside and pushing it up onto the other side of the ravine.",
          "While crossing underneath the bridge Tyche spots what appears to be a precious gem hanging underneath the bridge amongst Giant Spiders. A lucky shot with one of her spells and an even luckier grab using her quarterstaff gets the the treasure before the spiders notice what's happening. Only Idri gets caught in spiderweb trying to escape and with Arkri's help he still manages to get to safety before being bitten.",
          "<h3>Can't Stop Here, This is Shadow Country</h3>",
          "<blockquote class='recapquote'><em>\"We've dawdled too long, if you want to live get in this cart and do your best to keep them off of us.\"</em></blockquote>",
          "The group is still a mile outside of town when the sun sets. Without the light of the moon shadows lengthen then take on a life of their own. Everyone climbs into the merchant's cart and they begin a hcetic ride to get inside Mornrise's moat. The group hold off the shadows and get to safety. The merchant pays the group for sucessfully protecting his return home, even throwing in a share for Ronin and Idri who were more found on the way than hired.",
          "<h3>Mornrise</h3>",
          "The group splits up to take care of personal business in town before getting rooms at <a>Silverwood Inn</a> for the night. Idri vists the <a>Mornrise Chapel</a> and prays to the <a>Memorial of Childe Roland</a>. Tyche searchs for a tarot deck at the <a>Golden Swan</a> general store, and buys a magical sword from the proprietor <a>Walter</a> after impressig him with magical knowledge. Arkri meets up with her mysterious contact <a>Aleera</a> and receives her commission to forge documents of passage into Arden for the sisters who own the <a>Fleeting Fox Caravan</a>.",
          "<h3>The Mayor's House</h3>",
          "<blockquote class='recapquote'>The house seems ordinary enough until you come close and notice the mirrored glass in the door has been shattered. Protective symbols engraved on the door frame have been scratched out with a blade, and the door is slightly ajar. The square windows reveal nothing. The house is pitch black.</blockquote>",
          "The next morning Idri asks the group to return with her to Arowen's Chapel and inquire about a job in town. When they arrive <a>Priestess Fiora</a> briefly says the town has two issues: 1) the mayor disappeared and as of a few days ago people in town have begun to suspect his old house is haunted and 2) the <a>hawthorn tree</a> in the alchemical tower has begun to die, without living wood from the tree the village will be at the mercy of vampires. The group decides to investigate the house first.",
          "The mansion is a grisly scene of smashed glass and blood. A younger man's body is found in a downstairs living area and a mysterious trail of blood ends with a puddle in an upstairs music room.",
          "An angry spirit begins to attack the group but Idri soothes it with calming words and a prayer. Sheet music and a painting in the music room provide enough clues for Arkri to uncover a lockbox in one of the manor's bedrooms. The lockbox contains some emergency funds and an unsealed letter from 'Katrina' to 'Uncle Hanns' where she begs his expertise on silver and the moon to 'unlock a puzzle of utmost importance'. Ørigen acquires a <a>Violin of Banishing Light</a> and the group sets up a proper burial for the body to put the spirit to rest."
        ]
    }
  ],
  "comment": 
  {
        "title": "Sn - Title",
        "number": "n",
        "date": "yyyy Mon, DD",
        "text": [
          "text1",
          "text2"
        ]
    }
}